In [13]:
a = {'chicago':['10','11','12'],'location':['a','b','c']}

In [37]:
b= {'chicag':['20','21','22'],'location':['d','e','f']}

In [38]:
a['chicago'][2]

'12'

In [39]:
import numpy as np
import pandas as pd

In [40]:
data1 = pd.DataFrame(a)

In [41]:
data1

  chicago location
0      10        a
1      11        b
2      12        c

In [42]:
data2 = pd.DataFrame(b)

In [43]:
data2

  chicag location
0     20        d
1     21        e
2     22        f

In [44]:
pd.concat([data1,data2])

  chicago location chicag
0      10        a    NaN
1      11        b    NaN
2      12        c    NaN
0     NaN        d     20
1     NaN        e     21
2     NaN        f     22